---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadName
source: html/d61fc8cf-ba05-82b4-3b1a-f7879eed4844.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadName Property

The LoadName of the Electrical System.

## Syntax (C#)
```csharp
public string LoadName { get; set; }
```

## Remarks
This property is used to retrieve the LoadName of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.